<a href="https://colab.research.google.com/github/julianovale/pythonparatodos/blob/main/M%C3%B3dulo04Aula10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

dados_hist = {'Empresa 1': [4, 9, 6], 'Empresa 2': [9, 6, 4]}
dfh = pd.DataFrame(dados_hist)
dados_dia = pd.Series([5, 15],index=['Empresa 1', 'Empresa 2'])
nova_linha=pd.DataFrame([dados_dia],index=[3])
dfh = pd.concat([dfh, nova_linha])
dfh

   Empresa 1  Empresa 2
0          4          9
1          9          6
2          6          4
3          5         15

In [3]:
dfh[dfh > 4]

   Empresa 1  Empresa 2
0        NaN        9.0
1        9.0        6.0
2        6.0        NaN
3        5.0       15.0

In [4]:
dfh[dfh['Empresa 2']>5]

   Empresa 1  Empresa 2
0          4          9
1          9          6
3          5         15

In [6]:
dfh[dfh['Empresa 2']>6]

   Empresa 1  Empresa 2
0          4          9
3          5         15

In [7]:
dfh[dfh['Empresa 1']<5]

   Empresa 1  Empresa 2
0          4          9

In [8]:
dfh2 = dfh.copy()
dfh2[dfh2 <= 4] = 0.0
dfh2

   Empresa 1  Empresa 2
0          0          9
1          9          6
2          6          0
3          5         15